using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace WizEdit
{
    public class WizItem
    {
        private WIZ_SCN m_scn = WIZ_SCN.NO; 
        public WIZ_SCN SCN
        {
            get { return m_scn; }
            set { m_scn = value; }
        }
        private byte m_ID = 0;
        public byte ID
        {
            get { return m_ID; }
            set { m_ID = value; }
        }
        private byte m_Status = 0;
        public byte Status
        {
            get { return m_Status; }
            set { m_Status = value; }
        }
        public bool Indeterminate
        {
            get { return ((m_Status & 0x20) == 0x20); }
            set
            {
                if (value == true)
                {
                    m_Status = (byte)(m_Status | 0x20);
                }
                else
                {
                    m_Status = (byte)(m_Status & 0xDF);
                }
            }
        }
        public bool Curse
        {
            get { return ((m_Status & 0x40)  == 0x40); }
            set
            {
                if (value == true)
                {
                    m_Status = (byte)(m_Status | 0x40);
                }
                else
                {
                    m_Status = (byte)(m_Status & 0xBF);
                }
            }
        }
        public bool Equipment
        {
            get { return ((m_Status & 0x80 ) == 0x80); }
            set
            {
                if (value == true)
                {
                    m_Status = (byte)(m_Status | 0x80);
                }
                else
                {
                    m_Status = (byte)(m_Status & 0x7F);
                }
            }
        }
        public WizItem(WIZ_SCN scn = WIZ_SCN.S1)
        {
            m_scn = scn;
        }
        public string ItemName
        {
            get
            {
                switch (m_scn)
                {
                    case WIZ_SCN.S1:
                        return m_ItemName1[m_ID];
                    case WIZ_SCN.S2:
                        return m_ItemName2[m_ID];
                    case WIZ_SCN.S3:
                        return m_ItemName3[m_ID];
                    default:
                        return "";
                }

            }
        }
        public string CaptionText
        {
            get
            {
                string s = "";
                if(Curse == true)
                {
                    s += "- ";
                }else if( Equipment == true)
                {
                    s += "* ";

                }
                else
                {
                    s += "  ";
                }
                s += ItemName;
/*
                if ( Indeterminate == true)
                {
                    s += "Unknown";
                }
                else
                {
                    s += ItemName;
                }*/
                return s;
            }
        }
        public string [] ItemNames
        {
            get
            {
                switch (m_scn)
                {
                    case WIZ_SCN.S1:
                        return m_ItemName1;
                    case WIZ_SCN.S2:
                        return m_ItemName2;
                    case WIZ_SCN.S3:
                        return m_ItemName3;
                    default:
                        return new string[0];
                }

            }
        }
        #region Wiz1 ItemName
        private string[] m_ItemName1 = new string[]{
            "00:こわれたアイテム",
            "01:けん",
            "02:たんけん",
            "03:メイス",
            "04:フレイル",
            "05:つえ",
            "06:たんとう",
            "07:こがたのたて",
            "08:たて",
            "09:ローブ",
            "0A:かわのよろい",
            "0B:くさりかたびら",
            "0C:むねあて",
            "0D:よろい",
            "0E:かぶと",
            "0F:ちりょう",
            "10:どくけし",
            "11:きりさきのけん",
            "12:よいたんけん",
            "13:ふんさいのメイス",
            "14:てつのつえ",
            "15:ねむり",
            "16:かたいかわよろい",
            "17:ひかるくさりかたびら",
            "18:ますらおのよろい",
            "19:てつのたて",
            "1A:どうよろい",
            "1B:くつう",
            "1C:ほのお",
            "1D:なまくらなけん",
            "1E:げんめつのたんけん",
            "1F:わざわいのメイス",
            "20:かたいつえ",
            "21:ドラゴンスレイヤー",
            "22:にんたいのかぶと",
            "23:くさったかわよろい",
            "24:さびたくさりかたびら",
            "25:ひびわれたむねあて",
            "26:ゆがんだたて",
            "27:ほうせきのゆびわ",
            "28:くるしみ",
            "29:かくれみ",
            "2A:まっぷたつのけん",
            "2B:さいきょうのたんけん",
            "2C:ちからのメイス",
            "2D:あかり",
            "2E:くらやみ",
            "2F:どうのこて",
            "30:ごうかなかわよろい",
            "31:エルフのくさりかたびら",
            "32:ごくじょうのよろい",
            "33:ささえのたて",
            "34:あくのかぶと",
            "35:かいふく",
            "36:まもりのゆびわ",
            "37:ワースレイヤー",
            "38:メイジマッシャー",
            "39:ヘビのメイス",
            "3A:ちんもくのつえ",
            "3B:カシナートのつるぎ",
            "3C:いましめのゆびわ",
            "3D:ほのおのつえ",
            "3E:あくのくさりかたびら",
            "3F:ちゅうりつのよろい",
            "40:あくのたて",
            "41:ちっそくのゆびわ",
            "42:てんいのかぶと",
            "43:いちげき",
            "44:はめつのたんけん",
            "45:きりさきのたんとう",
            "46:やめるメイス",
            "47:ねじれたつえ",
            "48:はやわざのたんとう",
            "49:のろわれたローブ",
            "4A:はめつのかわよろい",
            "4B:のろいのくさりかたびら",
            "4C:あくまのむねあて",
            "4D:うつろのたて",
            "4E:ふるびたかぶと",
            "4F:きぼうのむねあて",
            "50:ぎんのこて",
            "51:あくのサーベル",
            "52:ソウルスレイヤー",
            "53:とうぞくのたんとう",
            "54:えいゆうのよろい",
            "55:せいなるよろい",
            "56:むらまさ",
            "57:しゅりけん",
            "58:こおりのくさりかたびら",
            "59:あくのよろい",
            "5A:まもりのたて",
            "5B:かいふくのゆびわ",
            "5C:はじゃのゆびわ",
            "5D:しのゆびわ",
            "5E:ワードナのまよけ",
            "5F:クマのおきもの",
            "60:カエルのおきもの",
            "61:せいどうのかぎ",
            "62:ぎんのかぎ",
            "63:きんのかぎ",
            "64:ブルーリボン"
        };
        private string[] m_ItemName2 = new string[]{
        "00:なし",
        "01:イアリシンのほうじゅ",
        "02:ちゅうりつのすいしょう",
        "03:あくのすいしょう",
        "04:ぜんのすいしょう",
        "05:びんづめのふね",
        "06:だいちのつえ",
        "07:くうきのまよけ",
        "08:せいすい",
        "09:ほのおのつえ",
        "0A:きんのメダリオン",
        "0B:ミューズフェズのほうじゅ",
        "0C:ちょうのナイフ（S.P.使用後）",
        "0D:たんけん",
        "0E:だんびら",
        "0F:メイス",
        "10:つえ",
        "11:オノ",
        "12:いくさオノ",
        "13:たんとう",
        "14:フレイル",
        "15:たて",
        "16:てつのたて",
        "17:まほうつかいのローブ",
        "18:かわのよろい",
        "19:くさりかたびら",
        "1A:むねあて",
        "1B:よろい",
        "1C:かぶと",
        "1D:きずぐすり",
        "1E:どくけし",
        "1F:たんけん＋1",
        "20:だんびら＋1",
        "21:メイス＋1",
        "22:いくさオノ＋1",
        "23:ヌンチャク",
        "24:たんとう＋1",
        "25:ねむりのまきもの",
        "26:かわのよろい＋1",
        "27:くさりかたびら＋1",
        "28:むねあて＋1",
        "29:よろい＋1",
        "2A:てつのたて＋1",
        "2B:てつのかぶと",
        "2C:てつのこて",
        "2D:くつうのまきもの",
        "2E:ほのおのくすり",
        "2F:たんけんー1",
        "30:だんびらー1",
        "31:メイスー1",
        "32:たんとうー1",
        "33:いくさオノー1",
        "34:マルゴーのフレイル",
        "35:ほうせきのふくろ",
        "36:まほうつかいのつえ",
        "37:ほのおのだんびら",
        "38:たてー1",
        "39:かわのよろいー1",
        "3A:くさりかたびらー1",
        "3B:むねあてー1",
        "3C:よろいー1",
        "3D:かぶとー1",
        "3E:かくれみのくすり",
        "3F:きんのゆびわ",
        "40:サラマンダーのゆびわ",
        "41:ヘビのきば",
        "42:たんけん＋2",
        "43:たんびら＋2",
        "44:いくさオノ＋2",
        "45:そうげのたんとう（Ｇ）",
        "46:こくたんのたんとう（Ｅ）",
        "47:こはくのたんとう（Ｎ）",
        "48:メイス＋2",
        "49:ミスリルのこて",
        "4A:まひのまよけ",
        "4B:かわのよろい＋2",
        "4C:てつのたて＋2",
        "4D:みかわしのローブ",
        "4E:くさりかたびら＋2",
        "4F:むねあて＋2",
        "50:よろい＋2",
        "51:はがねのかぶと",
        "52:ワーガンローブ",
        "53:きょじんのこんぼう",
        "54:カシナートのつるぎ",
        "55:ひつじかいのつえ",
        "56:じゃあくのオノ",
        "57:しのつえ",
        "58:まよけのほうせき",
        "59:エメラルドのふくろ",
        "5A:ガーネットのふくろ",
        "5B:あおしんじゅ",
        "5C:ルビーのスリッパ",
        "5D:ネクロマンサーのつえ",
        "5E:いのちのしょ",
        "5F:しのしょ",
        "60:ドラゴンのきば",
        "61:トロールのゆびわ",
        "62:ウサギのあし",
        "63:とうぞくのピック",
        "64:あくまのしょ",
        "65:チョウのナイフ（S.P.使用前）",
        "66:きんのティアラ",
        "67:カマキリのこて",
        "68:むらまさ",
        "69:しゅりけん",
        "6A:せいなるよろい",
        "6B:あかいくつ",
        "6C:きんのおの",
        "6D:きいろいみみせん",
        "6E:こはくのつえ"
    };
        private string[] m_ItemName3 = new string[]{
    "00:ガラクタ",
    "01:つるぎ",
    "02:たんけん",
    "03:メイス",
    "04:フレイル",
    "05:つえ",
    "06:たんとう",
    "07:バックラー",
    "08:たて",
    "09:ローブ",
    "0A:かわよろい",
    "0B:くさりかたびら",
    "0C:むねあて",
    "0D:よろい",
    "0E:かぶと",
    "0F:きずぐすり",
    "10:どくけし",
    "11:きりさきのけん",
    "12:するどいたんけん",
    "13:ふんさいのメイス",
    "14:てつのつえ",
    "15:ねむりのまきもの",
    "16:かたいかわよろい",
    "17:ひかるくさりかたびら",
    "18:ますらおのよろい",
    "19:てつのたて",
    "1A:どうよろい",
    "1B:いたみのまきもの",
    "1C:ほのおのまきもの",
    "1D:もろはのつるぎ",
    "1E:げんめつのたんけん",
    "1F:わざわいのメイス",
    "20:かたいつえ",
    "21:ドラゴンスレイヤー",
    "22:にんたいのかぶと",
    "23:くさったかわよろい",
    "24:さびたくさりかたびら",
    "25:れきせんのむねあて",
    "26:ゆがんだたて",
    "27:ほうせきのゆびわ",
    "28:くるしみのまきもの",
    "29:けむりだま",
    "2A:まっぷたつのけん",
    "2B:さいきょうのたんけん",
    "2C:ちからのメイス",
    "2D:みちびきのまきもの",
    "2E:めくらましのまきもの",
    "2F:どうのこて",
    "30:ごうかなかわよろい",
    "31:エルフのくさりかたびら",
    "32:ごくじょうのよろい",
    "33:ささえのたて",
    "34:あくのかぶと",
    "35:とっこうやく",
    "36:まもりのゆびわ",
    "37:ワースレイヤー",
    "38:メイジマッシャー",
    "39:ヘビのメイス",
    "3A:ちんもくのつえ",
    "3C:カシナートのつるぎ",
    "3B:いましめのゆびわ",
    "3D:ほのおのつえ",
    "3E:あくのくさりかたびら",
    "3F:ちゅうりつのよろい",
    "40:あくのたて",
    "41:ちっそくのゆびわ",
    "42:てんいのかぶと",
    "43:いちげきのまきもの",
    "44:はめつのたんけん",
    "45:きりさきのたんとう",
    "46:やめるメイス",
    "47:ねじれたつえ",
    "48:はやわざのたんとう",
    "49:のろわれたローブ",
    "4A:はめつのかわよろい",
    "4B:のろいのくさりかたびら",
    "4C:あくまのむねあて",
    "4D:うつろのたて",
    "4E:ふるびたかぶと",
    "4F:きぼうのむねあて",
    "50:ぎんのこて",
    "51:あくのサーベル",
    "52:ソウルスレイヤー",
    "53:とうぞくのたんとう",
    "54:えいゆうのよろい",
    "55:せいなるよろい",
    "56:むらまさ",
    "57:しゅりけん",
    "58:こおりのくさりかたびら",
    "59:あくのよろい",
    "5A:まもりのたて",
    "5B:かいふくのゆびわ",
    "5C:はじゃのゆびわ",
    "5D:しのゆびわ",
    "5E:ふっかつのつえ",
    "5F:いにしえのおまもり",
    "60:みかわしのローブ",
    "61:てぶくろ",
    "62:まふうじのネックレス",
    "63:ひかりのつえ",
    "64:エクスカリバー",
    "65:ひらめきのつるぎ",
    "66:プリーストパンチャー",
    "67:そうりょのメイス",
    "68:ひらめきのたんけん",
    "69:ほのおのゆびわ",
    "6A:のろわれたよろい",
    "6B:ミスリルのよろい",
    "6C:いやしのつえ",
    "6D:いのちのゆびわ",
    "6E:へんげのゆびわ",
    "6F:ふしぎないし",
    "70:きぼうのいし",
    "71:しんぴてきないし",
    "72:いだいなるまほうのつえ",
    "73:ちからのコイン",
    "74:わかがえりのいし",
    "75:こころのいし",
    "76:しんじんのいし",
    "77:ブラーニィのいし",
    "78:じゅくれんのまよけ",
    "79:じゅくれんのまよけ（使用後）",
    "7A:いだいなるまほうのつえ（使用後）",
    "7B:ちからのコイン（使用後）",
    "7C:ニルダのつえ",
    "7D:ハースニール",
    "7E:でんせつのかぶと",
    "7F:でんせつのたて",
    "80:でんせつのこて",
    "81:でんせつのよろい",
    "82:さびたかぎ",
    "83:ちまみれのバッジ",
    "84:きみょうなもんしょう",
    "85:こくたんのかぎ",
    "86:しゅうどういんのかぎ",
    "87:ミスリルのかぎ",
    "88:マスターキー",
    "89:あくまのいし"
    };

        public string[] ItemName1
        {
            get { return m_ItemName1; }
        }
        public string[] ItemName2
        {
            get { return m_ItemName2; }
        }
        public string[] ItemName3
        {
            get { return m_ItemName2; }
        }

        #endregion
    }
}
