unit Wiz1Const;

interface

Const


	//種族
	Wiz1Human	=	00;	// 人間
	Wiz1Elf		=	01;	// エルフ
	Wiz1Dwarf	=	02;	// ドワーフ
	Wiz1Gnome	=	03;	// ノーム
	Wiz1Hobit	=	04;	// ホビット
  //職業
	Wiz1Fighter	= 0;	//せんし
	Wiz1Mage		= 1;	//まほうつかい
	Wiz1Priest	= 2;	//そうりょ
	Wiz1Thief		= 3;	//シーフ
	Wiz1Bishop	= 4;	//ビショップ
	Wiz1Sumrai	= 5;	//サムライ
	Wiz1Lord		= 6;	//ロード
	Wiz1Ninja		= 7;	//ニンジャ
  //属性
	Wiz1Good		=00;	// Ｇ
	Wiz1Neutral	=01;	// Ｎ
	Wiz1Evil		=02;	// Ｅ
	Wiz1Etc			=03;	// ？ (？はどの属性とも組めるが、全ての装備が呪われるし、転職ができない。魔物？)

	Wiz1StatusCaption : array[0..7] of String =(
  	'Ok',
		'ねむっている',
		'おそれている',
		'まひしている',
		'いしになった',
		'しんでいる',
		'はいになった',
		'うしなわれた'
  	);
	 Wiz1ItemName : array[00..$64] of String =(
		'00:こわれたアイテム',
		'01:けん',
		'02:たんけん',
		'03:メイス',
		'04:フレイル',
		'05:つえ',
		'06:たんとう',
		'07:こがたのたて',
		'08:たて',
		'09:ローブ',
		'0A:かわのよろい',
		'0B:くさりかたびら',
		'0C:むねあて',
		'0D:よろい',
		'0E:かぶと',
		'0F:ちりょう',
		'10:どくけし',
		'11:きりさきのけん',
		'12:よいたんけん',
		'13:ふんさいのメイス',
		'14:てつのつえ',
		'15:ねむり',
		'16:かたいかわよろい',
		'17:ひかるくさりかたびら',
		'18:ますらおのよろい',
		'19:てつのたて',
		'1A:どうよろい',
		'1B:くつう',
		'1C:ほのお',
		'1D:なまくらなけん',
		'1E:げんめつのたんけん',
		'1F:わざわいのメイス',
		'20:かたいつえ',
		'21:ドラゴンスレイヤー',
		'22:にんたいのかぶと',
		'23:くさったかわよろい',
		'24:さびたくさりかたびら',
		'25:ひびわれたむねあて',
		'26:ゆがんだたて',
		'27:ほうせきのゆびわ',
		'28:くるしみ',
		'29:かくれみ',
		'2A:まっぷたつのけん',
		'2B:さいきょうのたんけん',
		'2C:ちからのメイス',
		'2D:あかり',
		'2E:くらやみ',
		'2F:どうのこて',
		'30:ごうかなかわよろい',
		'31:エルフのくさりかたびら',
		'32:ごくじょうのよろい',
		'33:ささえのたて',
		'34:あくのかぶと',
		'35:かいふく',
		'36:まもりのゆびわ',
		'37:ワースレイヤー',
		'38:メイジマッシャー',
		'39:ヘビのメイス',
		'3A:ちんもくのつえ',
		'3B:カシナートのつるぎ',
		'3C:いましめのゆびわ',
		'3D:ほのおのつえ',
		'3E:あくのくさりかたびら',
		'3F:ちゅうりつのよろい',
		'40:あくのたて',
		'41:ちっそくのゆびわ',
		'42:てんいのかぶと',
		'43:いちげき',
		'44:はめつのたんけん',
		'45:きりさきのたんとう',
		'46:やめるメイス',
		'47:ねじれたつえ',
		'48:はやわざのたんとう',
		'49:のろわれたローブ',
		'4A:はめつのかわよろい',
		'4B:のろいのくさりかたびら',
		'4C:あくまのむねあて',
		'4D:うつろのたて',
		'4E:ふるびたかぶと',
		'4F:きぼうのむねあて',
		'50:ぎんのこて',
		'51:あくのサーベル',
		'52:ソウルスレイヤー',
		'53:とうぞくのたんとう',
		'54:えいゆうのよろい',
		'55:せいなるよろい',
		'56:むらまさ',
		'57:しゅりけん',
		'58:こおりのくさりかたびら',
		'59:あくのよろい',
		'5A:まもりのたて',
		'5B:かいふくのゆびわ',
		'5C:はじゃのゆびわ',
		'5D:しのゆびわ',
		'5E:ワードナのまよけ',
		'5F:クマのおきもの',
		'60:カエルのおきもの',
		'61:せいどうのかぎ',
		'62:ぎんのかぎ',
		'63:きんのかぎ',
		'64:ブルーリボン'
	);

  Wiz1OffsetAdress	= $1952;
  Wiz1CharaDataSize	= $100;

	Wiz1Alive					= $00;
  Wiz1NameCount			= $01;
  Wiz1Name					= $02;
	  Wiz1NameLength		= $08;
  Wiz1Race					= $0A;
  Wiz1Job						= $0B;
  Wiz1Attr					= $0C;
  Wiz1Strength			= $0D;
  Wiz1IQ						= $0E;
  Wiz1Piety					= $0F;
  Wiz1Vitarity			= $10;
  Wiz1Agility				= $11;
  Wiz1Luck					= $12;
  Wiz1Gold					= $13;
	  Wiz1GoldLength		= $06;
  Wiz1Exp						= $19;
	  Wiz1ExpLength				= $06;
  Wiz1HP						= $1F;
  Wiz1HPmax					= $21;
  	Wiz1HPLength    	=$02;
  Wiz1Level					= $23;
  	Wiz1LevelLength    	=$02;
  Wiz1Status				= $25;
  Wiz1Age						= $26;
  Wiz1AC						= $28;
  Wiz1MP						= $29;
  Wiz1PP						= $30;
  Wiz1MPmax					= $37;
  Wiz1PPmax					= $3E;
  Wiz1Magic					= $45;
	  Wiz1MPlength			= $07;
  Wiz1ItemEquip			= $4C;
  Wiz1Item					= $54;
  Wiz1ItemCount			= $5C;
	  Wiz1ItemLength		= $08;
  Wiz1Poison				= $61;
  Wiz1Appellaction	= $62;
  Wiz1checksum			= $7E;
	  Wiz1checksumLength	= $02;
  Wiz1backup				= $80;
	  Wiz1backupLength	= $80;

	Wiz1Strings : array[0..$FF] of String=(
  {00}'０',{01}'１',{02}'２',{03}'３',{04}'４',{05}'５',{06}'６',{07}'７',{08}'８',{09}'９',{0A}'Ａ',{0B}'Ｂ',{0C}'Ｃ',{0D}'Ｄ',{0E}'Ｅ',{0F}'Ｆ',
  {10}'Ｇ',{11}'Ｈ',{12}'Ｉ',{13}'Ｊ',{14}'Ｋ',{15}'Ｌ',{16}'Ｍ',{17}'Ｎ',{18}'Ｏ',{19}'Ｐ',{1A}'Ｑ',{1B}'Ｒ',{1C}'Ｓ',{1D}'Ｔ',{1E}'Ｕ',{1F}'Ｖ',
  {20}'Ｗ',{21}'Ｘ',{22}'Ｙ',{23}'Ｚ',{24}'　',{25}'　',{26}'　',{27}'　',{28}'　',{29}'　',{2A}'／',{2B}'＊',{2C}'　',{2D}'！',{2E}'？',{2F}'　',
  {30}'’',{31}'．',{32}'，',{33}'　',{34}'＋',{35}'－',{36}'ﾟ ',{37}'ﾞ ',{38}'ア',{39}'イ',{3A}'ウ',{3B}'エ',{3C}'オ',{3D}'カ',{3E}'キ',{3F}'ク',
  {40}'ケ',{41}'コ',{42}'サ',{43}'シ',{44}'ス',{45}'セ',{46}'ソ',{47}'タ',{48}'チ',{49}'ツ',{4A}'テ',{4B}'ト',{4C}'ナ',{4D}'ニ',{4E}'ヌ',{4F}'ネ',
  {50}'ノ',{51}'ハ',{52}'ヒ',{53}'フ',{54}'ヘ',{55}'ホ',{56}'マ',{57}'ミ',{58}'ム',{59}'メ',{5A}'モ',{5B}'ヤ',{5C}'ユ',{5D}'ヨ',{5E}'ラ',{5F}'リ',
  {60}'ル',{61}'レ',{62}'ロ',{63}'ワ',{64}'ン',{65}'　',{66}'ァ',{67}'ィ',{68}'ェ',{69}'ォ',{6A}'ッ',{6B}'ャ',{6C}'ュ',{6D}'ョ',{6E}'あ',{6F}'い',
  {70}'う',{71}'え',{72}'お',{73}'か',{74}'き',{75}'く',{76}'け',{77}'こ',{78}'さ',{79}'し',{7A}'す',{7B}'せ',{7C}'そ',{7D}'た',{7E}'ち',{7F}'つ',
  {80}'て',{81}'と',{82}'な',{83}'に',{84}'ぬ',{85}'ね',{86}'の',{87}'は',{88}'ひ',{89}'ふ',{8A}'へ',{8B}'ほ',{8C}'ま',{8D}'み',{8E}'む',{8F}'め',
  {90}'も',{91}'や',{92}'ゆ',{93}'よ',{94}'ら',{95}'り',{96}'る',{97}'れ',{98}'ろ',{99}'わ',{9A}'ん',{9B}'　',{9C}'ッ',{9D}'ャ',{9E}'ュ',{9F}'ョ',
  {A0}'　',{A1}'　',{A2}'　',{A3}'　',{A4}'　',{A5}'　',{A6}'　',{A7}'　',{A8}'　',{A9}'　',{AA}'　',{AB}'　',{AC}'　',{AD}'　',{AE}'　',{AF}'　',
  {B0}'　',{B1}'　',{B2}'　',{B3}'　',{B4}'　',{B5}'　',{B6}'　',{B7}'　',{B8}'　',{B9}'　',{BA}'　',{BB}'　',{BC}'　',{BD}'　',{BE}'　',{BF}'　',
  {C0}'　',{C1}'　',{C2}'　',{C3}'　',{C4}'　',{C5}'　',{C6}'　',{C7}'　',{C8}'　',{C9}'　',{CA}'　',{CB}'　',{CC}'　',{CD}'　',{CE}'　',{CF}'　',
  {D0}'　',{D1}'　',{D2}'　',{D3}'　',{D4}'　',{D5}'　',{D6}'　',{D7}'　',{D8}'　',{D9}'　',{DA}'　',{DB}'　',{DC}'　',{DD}'　',{DE}'　',{DF}'　',
  {E0}'　',{E1}'　',{E2}'　',{E3}'　',{E4}'　',{E5}'　',{E6}'　',{E7}'　',{E8}'　',{E9}'　',{EA}'　',{EB}'　',{EC}'　',{ED}'　',{EE}'　',{EF}'　',
  {F0}'　',{F1}'　',{F2}'　',{F3}'　',{F4}'　',{F5}'　',{F6}'　',{F7}'　',{F8}'　',{F9}'　',{FA}'　',{FB}'　',{FC}'　',{FD}'　',{FE}'　',{FF}'　'
  );
type
	TWiz1Chara= record
	{00/01}	Alive				:Byte;
	{01/01}	NameCount		:Byte;
	{02/08}	Name				: array[0..7] of Byte;
	{0A/01}	Race				: Byte;	//種族0人1エルフ2Dwaf3Gno4Hob
	{0B/01}	Job					: Byte;	//職業0Fig1Mag2Pri3Thi4Bis5Sum6Lor7Nin
	{0C/01}	Attr				: Byte; //属性0善1中性2悪
	{0D/01}	Strength		: Byte;
	{0E/01}	IQ					: Byte;
	{0F/01}	Piety				: Byte;
	{10/01}	Vitarity		: Byte;
	{11/01}	Agility			: Byte;
	{12/01}	Luck				: Byte;
	{13/06}	Gold				: array[0..5] of Byte;
	{19/06}	Exp					: array[0..5] of Byte;
	{1F/02}	HP					: array[0..1] of Byte;
	{21/02}	HPmax				: array[0..1] of Byte;
	{23/02}	Level				: array[0..1] of Byte;
	{25/01}	Status			: Byte;
	{26/01}	Age					: Byte;
	{27/01}	unknown1		: Byte;
	{28/01}	AC					: Byte;
	{29/07}	MP					: array[0..6] of Byte;
	{30/07}	PP					: array[0..6] of Byte;
	{37/07}	MPmax				: array[0..6] of Byte;
	{3E/07}	PPmax				: array[0..6] of Byte;
	{45/07}	Magic				: array[0..6] of Byte;
	{4C/08}	ItemEquip		: array[0..7] of Byte;//Bit7呪いBit6不確定名Bit5
	{54/08}	Item				: array[0..7] of Byte;
	{5C/01}	ItemCount		: Byte;
	{5D/01}	unknown2		: Byte;
	{5E/01}	unknown3		: Byte;
	{5F/01}	unknown4		: Byte;
	{60/01}	unknown5		: Byte;
	{61/01}	Poison			: Byte;
	{62/01}	Appellaction: Byte;
	{63/00}	unknoen			: array[0..$1A] of Byte;
	{7E/02}	checksum		: array[0..1] of Byte;
	{80/80}	backup			: array[0..$7F] of Byte;
	End;
implementation

end.
