unit Wiz2Const;

interface

Const
	//種族              //76543210 5-6bit
	Wiz2Human	=	$00;		//00000000 人間
	Wiz2Elf		=	$20;		//00100000 エルフ
	Wiz2Dwarf	=	$40;		//01000000 ドワーフ
	Wiz2Gnome	=	$60;		//01100000 ノーム
	Wiz2Hobit	=	$80;		//10000000 ホビット
  //職業              //76543210 2-4bit
	Wiz2Fighter	= $00;	//00000000せんし
	Wiz2Mage		= $04;	//00000100まほうつかい
	Wiz2Priest	= $08;	//00001000そうりょ
	Wiz2Thief		= $0C;	//00001100シーフ
	Wiz2Bishop	= $10;	//00010000ビショップ
	Wiz2Sumrai	= $14;	//00010100サムライ
	Wiz2Lord		= $18;	//00011000ロード
	Wiz2Ninja		= $1C;	//00011100ニンジャ
  //属性              //76543210 0-1Bit
	Wiz2Good		=00;		//00000000 Ｇ
	Wiz2Neutral	=01;		//00000001 Ｎ
	Wiz2Evil		=02;		//00000010 Ｅ
	Wiz2Etc			=03;		//00000011 ？ (？はどの属性とも組めるが、全ての装備が呪われるし、転職ができない。魔物？)

	Wiz2ItemName : array[00..$6E] of String =(
		'00:なし',
		'01:イアリシンのほうじゅ',
		'02:ちゅうりつのすいしょう',
		'03:あくのすいしょう',
		'04:ぜんのすいしょう',
		'05:びんづめのふね',
		'06:だいちのつえ',
		'07:くうきのまよけ',
		'08:せいすい',
		'09:ほのおのつえ',
		'0A:きんのメダリオン',
		'0B:ミューズフェズのほうじゅ',
		'0C:ちょうのナイフ（S.P.使用後）',
		'0D:たんけん',
		'0E:だんびら',
		'0F:メイス',
		'10:つえ',
		'11:オノ',
		'12:いくさオノ',
		'13:たんとう',
		'14:フレイル',
		'15:たて',
		'16:てつのたて',
		'17:まほうつかいのローブ',
		'18:かわのよろい',
		'19:くさりかたびら',
		'1A:むねあて',
		'1B:よろい',
		'1C:かぶと',
		'1D:きずぐすり',
		'1E:どくけし',
		'1F:たんけん＋1',
		'20:だんびら＋1',
		'21:メイス＋1',
		'22:いくさオノ＋1',
		'23:ヌンチャク',
		'24:たんとう＋1',
		'25:ねむりのまきもの',
		'26:かわのよろい＋1',
		'27:くさりかたびら＋1',
		'28:むねあて＋1',
		'29:よろい＋1',
		'2A:てつのたて＋1',
		'2B:てつのかぶと',
		'2C:てつのこて',
		'2D:くつうのまきもの',
		'2E:ほのおのくすり',
		'2F:たんけんー1',
		'30:だんびらー1',
		'31:メイスー1',
		'32:たんとうー1',
		'33:いくさオノー1',
		'34:マルゴーのフレイル',
		'35:ほうせきのふくろ',
		'36:まほうつかいのつえ',
		'37:ほのおのだんびら',
		'38:たてー1',
		'39:かわのよろいー1',
		'3A:くさりかたびらー1',
		'3B:むねあてー1',
		'3C:よろいー1',
		'3D:かぶとー1',
		'3E:かくれみのくすり',
		'3F:きんのゆびわ',
		'40:サラマンダーのゆびわ',
		'41:ヘビのきば',
		'42:たんけん＋2',
		'43:たんびら＋2',
		'44:いくさオノ＋2',
		'45:そうげのたんとう（Ｇ）',
		'46:こくたんのたんとう（Ｅ）',
		'47:こはくのたんとう（Ｎ）',
		'48:メイス＋2',
		'49:ミスリルのこて',
		'4A:まひのまよけ',
		'4B:かわのよろい＋2',
		'4C:てつのたて＋2',
		'4D:みかわしのローブ',
		'4E:くさりかたびら＋2',
		'4F:むねあて＋2',
		'50:よろい＋2',
		'51:はがねのかぶと',
		'52:ワーガンローブ',
		'53:きょじんのこんぼう',
		'54:カシナートのつるぎ',
		'55:ひつじかいのつえ',
		'56:じゃあくのオノ',
		'57:しのつえ',
		'58:まよけのほうせき',
		'59:エメラルドのふくろ',
		'5A:ガーネットのふくろ',
		'5B:あおしんじゅ',
		'5C:ルビーのスリッパ',
		'5D:ネクロマンサーのつえ',
		'5E:いのちのしょ',
		'5F:しのしょ',
		'60:ドラゴンのきば',
		'61:トロールのゆびわ',
		'62:ウサギのあし',
		'63:とうぞくのピック',
		'64:あくまのしょ',
		'65:チョウのナイフ（S.P.使用前）',
		'66:きんのティアラ',
		'67:カマキリのこて',
		'68:むらまさ',
		'69:しゅりけん',
		'6A:せいなるよろい',
		'6B:あかいくつ',
		'6C:きんのおの',
		'6D:きいろいみみせん',
		'6E:こはくのつえ'
	);

	Wiz2Strings : array[0..$FF] of String=(
  {00}'　',{01}'　',{02}'　',{03}'　',{04}'　',{05}'　',{06}'　',{07}'　',{08}'　',{09}'　',{0A}'　',{0B}'　',{0C}'　',{0D}'　',{0E}'　',{0F}'　',
  {10}'　',{11}'　',{12}'　',{13}'　',{14}'　',{15}'　',{16}'　',{17}'　',{18}'　',{19}'　',{1A}'　',{1B}'　',{1C}'　',{1D}'　',{1E}'　',{1F}'　',
  {20}'　',{21}'！',{22}'”',{23}'＃',{24}'＄',{25}'％',{26}'＆',{27}'’',{28}'（',{29}'）',{2A}'＊',{2B}'＋',{2C}'，',{2D}'－',{2E}'．',{2F}'／',
  {30}'０',{31}'１',{32}'２',{33}'３',{34}'４',{35}'５',{36}'６',{37}'７',{38}'８',{39}'９',{3A}'：',{3B}'；',{3C}'＜',{3D}'＝',{3E}'＞',{3F}'？',
  {40}'＠',{41}'Ａ',{42}'Ｂ',{43}'Ｃ',{44}'Ｄ',{45}'Ｅ',{46}'Ｆ',{47}'Ｇ',{48}'Ｈ',{49}'Ｉ',{4A}'Ｊ',{4B}'Ｋ',{4C}'Ｌ',{4D}'Ｍ',{4E}'Ｎ',{4F}'Ｏ',
  {50}'Ｐ',{51}'Ｑ',{52}'Ｒ',{53}'Ｓ',{54}'Ｔ',{55}'Ｕ',{56}'Ｖ',{57}'Ｗ',{58}'Ｘ',{59}'Ｙ',{5A}'Ｚ',{5B}'［',{5C}'￥',{5D}'］',{5E}'＾',{5F}'＿',
  {60}'‘',{61}'ａ',{62}'ｂ',{63}'ｃ',{64}'ｄ',{65}'ｅ',{66}'ｆ',{67}'ｇ',{68}'ｈ',{69}'ｉ',{6A}'ｊ',{6B}'ｋ',{6C}'ｌ',{6D}'ｍ',{6E}'ｎ',{6F}'ｏ',
  {70}'ｐ',{71}'ｑ',{72}'ｒ',{73}'ｓ',{74}'ｔ',{75}'ｕ',{76}'ｖ',{77}'ｗ',{78}'ｘ',{79}'ｙ',{7A}'ｚ',{7B}'｛',{7C}'｜',{7D}'｝',{7E}'～',{7F}'　',
  {80}'〒',{81}'▼',{82}'★',{83}'◆',{84}'○',{85}'●',{86}'を',{87}'ぁ',{88}'ぃ',{89}'ぅ',{8A}'ぇ',{8B}'ぉ',{8C}'ゃ',{8D}'ゅ',{8E}'ょ',{8F}'っ',
  {90}'ー',{91}'あ',{92}'い',{93}'う',{94}'え',{95}'お',{96}'か',{97}'き',{98}'く',{99}'け',{9A}'こ',{9B}'さ',{9C}'し',{9D}'す',{9E}'せ',{9F}'そ',
  {A0}'の',{A1}'。',{A2}'薬',{A3}'巻',{A4}'、',{A5}'。',{A6}'ヲ',{A7}'ァ',{A8}'ィ',{A9}'ゥ',{AA}'ェ',{AB}'ォ',{AC}'ャ',{AD}'ュ',{AE}'ョ',{AF}'ッ',
  {B0}'ー',{B1}'ア',{B2}'イ',{B3}'ウ',{B4}'エ',{B5}'オ',{B6}'カ',{B7}'キ',{B8}'ク',{B9}'ケ',{BA}'コ',{BB}'サ',{BC}'シ',{BD}'ス',{BE}'セ',{BF}'ソ',
  {C0}'タ',{C1}'チ',{C2}'ツ',{C3}'テ',{C4}'ト',{C5}'ナ',{C6}'ニ',{C7}'ヌ',{C8}'ネ',{C9}'ノ',{CA}'ハ',{CB}'ヒ',{CC}'フ',{CD}'ヘ',{CE}'ホ',{CF}'マ',
  {D0}'ミ',{D1}'ム',{D2}'メ',{D3}'モ',{D4}'ヤ',{D5}'ユ',{D6}'ヨ',{D7}'ラ',{D8}'リ',{D9}'ル',{DA}'レ',{DB}'ロ',{DC}'ワ',{DD}'ン',{DE}'゛',{DF}'゜',
  {E0}'た',{E1}'ち',{E2}'つ',{E3}'て',{E4}'と',{E5}'な',{E6}'に',{E7}'ぬ',{E8}'ね',{E9}'の',{EA}'は',{EB}'ひ',{EC}'ふ',{ED}'へ',{EE}'ほ',{EF}'ま',
  {F0}'み',{F1}'む',{F2}'め',{F3}'も',{F4}'や',{F5}'ゆ',{F6}'よ',{F7}'ら',{F8}'り',{F9}'る',{FA}'れ',{FB}'ろ',{FC}'わ',{FD}'ん',{FE}'゛',{FF}'゜ '
  );

  Wiz2OffsetAdress	= $1D52;

  Wiz2CharaDataSize	= $60;

	Wiz2Alive					= $00;
  Wiz2NameCount			= $01;
  Wiz2Name					= $02;
	  Wiz2NameLength		= $08;
  Wiz2Job						= $0A;
  Wiz2Strength			= $0B;
  Wiz2IQ						= $0C;
  Wiz2Piety					= $0D;
  Wiz2Vitarity			= $0E;
  Wiz2Agility				= $0F;
  Wiz2Luck					= $10;
  Wiz2Gold					= $11;
	  Wiz2GoldLength		= $06;
  Wiz2Exp						= $17;
	  Wiz2ExpLength				= $06;
  Wiz2HP						= $1D;
  Wiz2HPmax					= $1F;
  	Wiz2HPLength    	=$02;
  Wiz2Level					= $21;
  	Wiz2LevelLength    	=$02;
  Wiz2Status				= $23;
  Wiz2Age						= $24;
  Wiz2AC						= $26;
  Wiz2MP						= $27;
  Wiz2PP						= $2E;
  Wiz2MSkill				= $35;
  Wiz2PSkill				= $3C;
	  Wiz2MPlength			= $07;
  Wiz2ItemEquip			= $43;
  Wiz2Item					= $4B;
  Wiz2ItemCount			= $53;
	  Wiz2ItemLength		= $08;
  Wiz2Poison				= $54;
  Wiz2Appellaction	= $58;
  Wiz2checksum			= $5E;
	  Wiz2checksumLength	= $02;
type
	TWiz2Chara= record
	{00/01}	Alive				: Byte;
	{01/01}	NameCount		: Byte;
	{02/08}	Name				: array[0..7] of Byte;
	{0A/01}	Job					: Byte;	//種族・職業・属性（種族・職業・属性の数値を足した結果を入力。
	{0B/01}	Strength		: Byte;
	{0C/01}	IQ					: Byte;
	{0D/01}	Piety				: Byte;
	{0E/01}	Vitarity		: Byte;
	{0F/01}	Agility			: Byte;
	{10/01}	Luck				: Byte;
	{11/06}	Gold				: array[0..5] of Byte;
	{17/06}	Exp					: array[0..5] of Byte;
	{1D/02}	HP					: array[0..1] of Byte;
	{1F/02}	HPmax				: array[0..1] of Byte;
	{21/02}	Level				: array[0..1] of Byte;
	{23/01}	Status			: Byte;
	{24/01}	Age					: Byte;
	{25/01}	unknown1		: Byte;
	{26/01}	AC					: Byte;
	{27/07}	MP					: array[0..6] of Byte;
	{2E/07}	PP					: array[0..6] of Byte;
	{35/07}	MSkill			: array[0..6] of Byte;
	{3C/07}	PSkill			: array[0..6] of Byte;
	{43/08}	ItemEquip		: array[0..7] of Byte;//Bit7呪いBit6不確定名Bit5
	{4B/08}	Item				: array[0..7] of Byte;
	{53/01}	ItemCount		: Byte;
	{54/01}	Poison			: Byte;
	{55/03}	unknoen			: array[0..2] of Byte;
	{58/01}	Appellaction: Byte;
	{59/05}	unknown2		: array[0..4] of Byte;
	{5E/02}	checksum		: array[0..1] of Byte;
	End;
implementation

end.
